Ran Plan for 4 projects:

1. dir: `live/atlantis/iam` workspace: `default`
1. dir: `live/dev/iam` workspace: `default`
1. dir: `live/dev/ec2` workspace: `default`
1. dir: `live/qa/ec2` workspace: `default`

### 1. dir: `live/atlantis/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:35:41 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:35:41 Running command: terraform --version
[terragrunt] 2020/01/14 08:35:41 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/SourceAccountIAM. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:35:41 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/SourceAccountIAM into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] 2020/01/14 08:35:41 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] 2020/01/14 08:35:41 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/.terragrunt-cache/Nz3skicHKcq2n6iXRIvOkw2K4CA/XPe3XsLpXX7yiTmKxAv3kALkM6g
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:35:41 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam] 2020/01/14 08:35:41 Running command: terraform init -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true -backend-config=key=iam/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:35:44 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.policy: Refreshing state...
data.aws_iam_policy_document.assume_role_policy: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.sourceaccountrolepolicy will be created
  + resource "aws_iam_policy" "sourceaccountrolepolicy" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "SourceAccountRole"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.sourceaccountrole will be created
  + resource "aws_iam_role" "sourceaccountrole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Managed by Terraform"
      + force_detach_policies = true
      + id                    = (known after apply)
      + max_session_duration  = 36000
      + name                  = "SourceAccountRole"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.sourceaccountrolepolicyattach will be created
  + resource "aws_iam_role_policy_attachment" "sourceaccountrolepolicyattach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SourceAccountRole"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Quoted type constraints are deprecated

  on vars.tf line 7, in variable "name":
   7:   type        = "string"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "string".

(and 4 more similar warnings elsewhere)


------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/atlantis/iam/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 2. dir: `live/dev/iam` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "terragrunt plan -no-color -out $PLANFILE" in "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam": 
[terragrunt] 2020/01/14 08:35:47 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 08:35:47 Running command: terraform --version
[terragrunt] 2020/01/14 08:35:47 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/TargetAccountIAM. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:35:47 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/TargetAccountIAM into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] 2020/01/14 08:35:47 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] 2020/01/14 08:35:47 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam/.terragrunt-cache/zDPPC18DOE-48-wqXS9Nb8bsd0g/ZfE9b6ZD3Yu4Yt9XdKwzRMWtwl8
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 08:35:47 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/iam] 2020/01/14 08:35:47 Running command: terraform init -backend-config=key=iam/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true
[31mThere are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.[0m[0m
[33m
[1m[33mWarning: [0m[0m[1mInterpolation-only expressions are deprecated[0m

[0m  on main.tf line 54, in resource "aws_iam_policy" "policies":
  54:   count = [4m"${length(var.policies)}"[0m
[0m
Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 4 more similar warnings elsewhere)
[0m[0m
[33m
[1m[33mWarning: [0m[0m[1mQuoted type constraints are deprecated[0m

[0m  on vars.tf line 51, in variable "tags":
  51:   type        = [4m"map"[0m
[0m
Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "map" and write
map(string) instead to explicitly indicate that the map elements are strings.

(and one more similar warning elsewhere)
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 13, in output "assumer_account_role_arn":
  13: [4m[0m
[0m  15: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mUnterminated template string[0m

[0m  on outputs.tf line 13, in output "assumer_account_role_arn":
  12: [4m[0m
[0m  13: [4m[0m
[0m  15: [4m[0m
[0m
No closing marker was found for the string.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 15, in output "assumer_account_role_arn":
  15: [4m[0m
[0m  16: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 16, in output "assumer_account_role_arn":
  16: [4m[0m
[0m  17: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 17, in output "assumer_account_role_arn":
  17: [4m[0m
[0m  18: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 18, in output "assumer_account_role_arn":
  18: [4m[0m
[0m  20: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 20, in output "assumer_account_role_arn":
  20: [4m[0m
[0m  21: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 21, in output "assumer_account_role_arn":
  21: [4m[0m
[0m  22: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 22, in output "assumer_account_role_arn":
  22: [4m[0m
[0m  23: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 23, in output "assumer_account_role_arn":
  23: [4m[0m
[0m  25: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 25, in output "assumer_account_role_arn":
  25: [4m[0m
[0m  26: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 26, in output "assumer_account_role_arn":
  26: [4m[0m
[0m  27: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 27, in output "assumer_account_role_arn":
  27: [4m[0m
[0m  29: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 29, in output "assumer_account_role_arn":
  29: [4m[0m
[0m  30: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 30, in output "assumer_account_role_arn":
  30: [4m[0m
[0m  31: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 31, in output "assumer_account_role_arn":
  31: [4m[0m
[0m  32: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 32, in output "assumer_account_role_arn":
  32: [4m[0m
[0m  34: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 34, in output "assumer_account_role_arn":
  34: [4m[0m
[0m  35: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 35, in output "assumer_account_role_arn":
  35: [4m[0m
[0m  36: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 36, in output "assumer_account_role_arn":
  36: [4m[0m
[0m  37: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 37, in output "assumer_account_role_arn":
  37: [4m[0m
[0m  39: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 39, in output "assumer_account_role_arn":
  39: [4m[0m
[0m  40: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 40, in output "assumer_account_role_arn":
  40: [4m[0m
[0m  41: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 41, in output "assumer_account_role_arn":
  41: [4m[0m
[0m  42: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 42, in output "assumer_account_role_arn":
  42: [4m[0m
[0m  44: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 44, in output "assumer_account_role_arn":
  44: [4m[0m
[0m  45: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 45, in output "assumer_account_role_arn":
  45: [4m[0m
[0m  46: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 46, in output "assumer_account_role_arn":
  46: [4m[0m
[0m  47: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 47, in output "assumer_account_role_arn":
  47: [4m[0m
[0m  49: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 49, in output "assumer_account_role_arn":
  49: [4m[0m
[0m  50: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 50, in output "assumer_account_role_arn":
  50: [4m[0m
[0m  51: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 51, in output "assumer_account_role_arn":
  51: [4m[0m
[0m  52: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 52, in output "assumer_account_role_arn":
  52: [4m[0m
[0m  54: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 54, in output "assumer_account_role_arn":
  54: [4m[0m
[0m  55: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 55, in output "assumer_account_role_arn":
  55: [4m[0m
[0m  56: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 56, in output "assumer_account_role_arn":
  56: [4m[0m
[0m  57: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 57, in output "assumer_account_role_arn":
  57: [4m[0m
[0m  59: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 59, in output "assumer_account_role_arn":
  59: [4m[0m
[0m  60: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 60, in output "assumer_account_role_arn":
  60: [4m[0m
[0m  61: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 61, in output "assumer_account_role_arn":
  61: [4m[0m
[0m  62: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 62, in output "assumer_account_role_arn":
  62: [4m[0m
[0m  64: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 64, in output "assumer_account_role_arn":
  64: [4m[0m
[0m  65: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 65, in output "assumer_account_role_arn":
  65: [4m[0m
[0m  66: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 66, in output "assumer_account_role_arn":
  66: [4m[0m
[0m  68: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 68, in output "assumer_account_role_arn":
  68: [4m[0m
[0m  69: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 69, in output "assumer_account_role_arn":
  69: [4m[0m
[0m  70: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 70, in output "assumer_account_role_arn":
  70: [4m[0m
[0m  71: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 71, in output "assumer_account_role_arn":
  71: [4m[0m
[0m  73: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 73, in output "assumer_account_role_arn":
  73: [4m[0m
[0m  74: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 74, in output "assumer_account_role_arn":
  74: [4m[0m
[0m  75: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 75, in output "assumer_account_role_arn":
  75: [4m[0m
[0m  76: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 76, in output "assumer_account_role_arn":
  76: [4m[0m
[0m  78: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 78, in output "assumer_account_role_arn":
  78: [4m[0m
[0m  79: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 79, in output "assumer_account_role_arn":
  79: [4m[0m
[0m  80: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 80, in output "assumer_account_role_arn":
  80: [4m[0m
[0m  81: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 81, in output "assumer_account_role_arn":
  81: [4m[0m
[0m  83: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 83, in output "assumer_account_role_arn":
  83: [4m[0m
[0m  84: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 84, in output "assumer_account_role_arn":
  84: [4m[0m
[0m  85: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 85, in output "assumer_account_role_arn":
  85: [4m[0m
[0m  86: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 86, in output "assumer_account_role_arn":
  86: [4m[0m
[0m  88: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 88, in output "assumer_account_role_arn":
  88: [4m[0m
[0m  89: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 89, in output "assumer_account_role_arn":
  89: [4m[0m
[0m  90: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 90, in output "assumer_account_role_arn":
  90: [4m[0m
[0m  91: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 91, in output "assumer_account_role_arn":
  91: [4m[0m
[0m  93: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 93, in output "assumer_account_role_arn":
  93: [4m[0m
[0m  94: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 94, in output "assumer_account_role_arn":
  94: [4m[0m
[0m  95: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 95, in output "assumer_account_role_arn":
  95: [4m[0m
[0m  97: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 97, in output "assumer_account_role_arn":
  97: [4m[0m
[0m  98: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 98, in output "assumer_account_role_arn":
  98: [4m[0m
[0m  99: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 99, in output "assumer_account_role_arn":
  99: [4m[0m
[0m 100: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 100, in output "assumer_account_role_arn":
 100: [4m[0m
[0m 102: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 102, in output "assumer_account_role_arn":
 102: [4m[0m
[0m 103: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 103, in output "assumer_account_role_arn":
 103: [4m[0m
[0m 104: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 104, in output "assumer_account_role_arn":
 104: [4m[0m
[0m 105: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 105, in output "assumer_account_role_arn":
 105: [4m[0m
[0m 107: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 107, in output "assumer_account_role_arn":
 107: [4m[0m
[0m 108: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 108, in output "assumer_account_role_arn":
 108: [4m[0m
[0m 109: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 109, in output "assumer_account_role_arn":
 109: [4m[0m
[0m 110: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 110, in output "assumer_account_role_arn":
 110: [4m[0m
[0m 112: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 112, in output "assumer_account_role_arn":
 112: [4m[0m
[0m 113: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 113, in output "assumer_account_role_arn":
 113: [4m[0m
[0m 114: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 114, in output "assumer_account_role_arn":
 114: [4m[0m
[0m 115: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 115, in output "assumer_account_role_arn":
 115: [4m[0m
[0m 117: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 117, in output "assumer_account_role_arn":
 117: [4m[0m
[0m 118: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 118, in output "assumer_account_role_arn":
 118: [4m[0m
[0m 119: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 119, in output "assumer_account_role_arn":
 119: [4m[0m
[0m 121: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 121, in output "assumer_account_role_arn":
 121: [4m[0m
[0m 122: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 122, in output "assumer_account_role_arn":
 122: [4m[0m
[0m 123: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 123, in output "assumer_account_role_arn":
 123: [4m[0m
[0m 124: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 124, in output "assumer_account_role_arn":
 124: [4m[0m
[0m 126: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 126, in output "assumer_account_role_arn":
 126: [4m[0m
[0m 127: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 127, in output "assumer_account_role_arn":
 127: [4m[0m
[0m 128: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 128, in output "assumer_account_role_arn":
 128: [4m[0m
[0m 129: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 129, in output "assumer_account_role_arn":
 129: [4m[0m
[0m 131: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 131, in output "assumer_account_role_arn":
 131: [4m[0m
[0m 132: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 132, in output "assumer_account_role_arn":
 132: [4m[0m
[0m 133: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 133, in output "assumer_account_role_arn":
 133: [4m[0m
[0m 134: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 134, in output "assumer_account_role_arn":
 134: [4m[0m
[0m 136: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 136, in output "assumer_account_role_arn":
 136: [4m[0m
[0m 137: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 137, in output "assumer_account_role_arn":
 137: [4m[0m
[0m 138: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 138, in output "assumer_account_role_arn":
 138: [4m[0m
[0m 139: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[31m
[1m[31mError: [0m[0m[1mInvalid multi-line string[0m

[0m  on outputs.tf line 139, in output "assumer_account_role_arn":
 139: [4m[0m
[0m
Quoted strings may not be split over multiple lines. To produce a multi-line
string, either use the \n escape to represent a newline character or use the
"heredoc" multi-line template syntax.
[0m[0m
[terragrunt] 2020/01/14 08:35:48 Hit multiple errors:
exit status 1


```
</details>

---
### 3. dir: `live/dev/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:35:48 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:35:48 Running command: terraform --version
[terragrunt] 2020/01/14 08:35:48 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:35:48 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:35:48 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:35:48 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/.terragrunt-cache/ErdqrgXWbfRJ5mreRtvcZY9jddk/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:35:48 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2] 2020/01/14 08:35:48 Running command: terraform init -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1 -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:35:50 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver-example-qa"
        }
    }

  # aws_elb.webserver_example will be created
  + resource "aws_elb" "webserver_example" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + connection_draining         = false
      + connection_draining_timeout = 300
      + cross_zone_load_balancing   = true
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "webserver-example-qa"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_launch_configuration.webserver_example will be created
  + resource "aws_launch_configuration" "webserver_example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0987ee37af7792903"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "4430fd6498339061effa6d27ccf341a1e94569d7"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-asg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.elb will be created
  + resource "aws_security_group" "elb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "webserver-example-qa-elb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.asg_allow_http_inbound will be created
  + resource "aws_security_group_rule" "asg_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # aws_security_group_rule.elb_allow_all_outbound will be created
  + resource "aws_security_group_rule" "elb_allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.elb_allow_http_inbound will be created
  + resource "aws_security_group_rule" "elb_allow_http_inbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/dev/ec2/default.tfplan"


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>

---
### 4. dir: `live/qa/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2020/01/14 08:35:54 Reading Terragrunt config file at /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/terragrunt.hcl
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:35:54 Running command: terraform --version
[terragrunt] 2020/01/14 08:35:54 WARNING: no double-slash (//) found in source URL /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules. Relative paths in downloaded Terraform code may not work.
[terragrunt] 2020/01/14 08:35:54 Downloading Terraform configurations from file:///home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/modules/web-server-modules into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:35:54 Copying files from /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2 into /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] 2020/01/14 08:35:54 Setting working directory to /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/.terragrunt-cache/Df1CSgdfOPgjThjVvF0oPqVcTs8/vf0kskWgg0hVkbtLHE6PPTaGe0Q
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:35:54 Initializing remote state for the s3 backend
[terragrunt] [/home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2] 2020/01/14 08:35:54 Running command: terraform init -backend-config=bucket=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=dynamodb_table=aws-poc-sparebank1-terragrunt-example-terraform-state-dev -backend-config=encrypt=true -backend-config=key=ec2/terraform.tfstate -backend-config=region=eu-west-1

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.44.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 2.44"

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
[terragrunt] 2020/01/14 08:35:57 Running command: terraform plan -no-color -out /home/ubuntu/.atlantis/repos/vaibhav-walke/terragrunt/3/default/live/qa/ec2/default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_availability_zones.all: Refreshing state...
data.aws_ami.ubuntu: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_group.webserver_example will be created
  + resource "aws_autoscaling_group" "webserver_example" {
      + arn                       = (known after apply)
      + availability_zones        = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = [
          + "webserver-example-qa",
        ]
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.